app/views/post/show.html.erb

<% @post.comments.reverse.each_with_index do |comment, i| %>
  <%= @post.comments.length - i %>번째 댓글 : <p><%= comment.content %></p>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]