app/controllers/post_controller.rb

SELECT "posts".* FROM "posts"
---
  def index

    @posts = Post.all.reverse

INSERT INTO "posts" ("username", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "33333333333"], ["title", "3333333333333"], ["content", "333333333333333"], ["created_at", "2017-12-21 00:36:11.009600"], ["updated_at", "2017-12-21 00:36:11.009600"]]
---
  def create
    # params[:username]  params[:title] params[:content]
    # 1번 방법
    Post.create(:username => params[:username],
              :title => params[:title],
              :content => params[:content])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
  def show
    # 어떤 글을 보여주겠다.
    # @변수를 통해서 erb 파일에서 보여준다.
    @post = Post.find(params[:id])
    @comments = Comment.all

INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "시르다"], ["post_id", 1], ["created_at", "2017-12-21 00:36:20.781891"], ["updated_at", "2017-12-21 00:36:20.781891"]]
---
  def add_comment
    Comment.create(
      content: params[:content],
      post_id: params[:id]
    )