app/controllers/user_controller.rb

  def create
    #db생성
    @user = User.create(
      email: params[:email],
      name: params[:name],
      password: params[:password]
    )
---
INSERT INTO "users" ("email", "name", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "fdd@dccc.com"], ["name", "fd"], ["password", "ggff"], ["created_at", "2017-12-21 02:01:02.611185"], ["updated_at", "2017-12-21 02:01:02.611185"]]

  def login_process
    # 0. 사용자에게 받는 것(params[:email], params[:password], params[:name])
    @user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "sksksk@email.com"]]